## Step 1) import libraries

In [1]:
import pandas as pd
import matplotlib.pyplot as plt

## Step 2) Load dataset

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', sep = '|')

In [3]:
df.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

## Step 3) Assing it to a variable 'user_id'

In [4]:
user_id = df

## Step 4) See the first 25 entries

In [5]:
user_id.head(25)

    user_id  age gender     occupation zip_code
0         1   24      M     technician    85711
1         2   53      F          other    94043
2         3   23      M         writer    32067
3         4   24      M     technician    43537
4         5   33      F          other    15213
5         6   42      M      executive    98101
6         7   57      M  administrator    91344
7         8   36      M  administrator    05201
8         9   29      M        student    01002
9        10   53      M         lawyer    90703
10       11   39      F          other    30329
11       12   28      F          other    06405
12       13   47      M       educator    29206
13       14   45      M      scientist    55106
14       15   49      F       educator    97301
15       16   21      M  entertainment    10309
16       17   30      M     programmer    06355
17       18   35      F          other    37212
18       19   40      M      librarian    02138
19       20   42      F      homemaker    95660
20       21   26      M         writer    30068
21       22   25      M         writer    40206
22       23   30      F         artist    48197
23       24   21      F         artist    94533
24       25   39      M       engineer    55107

## Step 5) See th last 10 entries

In [6]:
user_id.tail(10)

     user_id  age gender     occupation zip_code
933      934   61      M       engineer    22902
934      935   42      M         doctor    66221
935      936   24      M          other    32789
936      937   48      M       educator    98072
937      938   38      F     technician    55038
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

In [7]:
user_id.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
user_id       943 non-null int64
age           943 non-null int64
gender        943 non-null object
occupation    943 non-null object
zip_code      943 non-null object
dtypes: int64(2), object(3)
memory usage: 36.9+ KB

## Step 6) WHat is the number of observations in the dataset?

In [8]:
## 943 observations

## Step 7) WHat is the number of columns in the dataset?

In [9]:
## 5 columns

## Step 8) Print the name of all columns

In [13]:
user_id.columns

Index([u'user_id', u'age', u'gender', u'occupation', u'zip_code'], dtype='object')

## Step 9) How is the dataset indexed?

In [14]:
user_id.index

RangeIndex(start=0, stop=943, step=1)

## Step 10) WHat is the data type of each column?

In [15]:
user_id.columns

Index([u'user_id', u'age', u'gender', u'occupation', u'zip_code'], dtype='object')

In [16]:
## Object?

## Step 11) Print only the occupation column

In [17]:
user_id.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [18]:
user_id.occupation

0         technician
1              other
2             writer
3         technician
4              other
5          executive
6      administrator
7      administrator
8            student
9             lawyer
10             other
11             other
12          educator
13         scientist
14          educator
15     entertainment
16        programmer
17             other
18         librarian
19         homemaker
20            writer
21            writer
22            artist
23            artist
24          engineer
25          engineer
26         librarian
27            writer
28        programmer
29           student
           ...
913            other
914    entertainment
915         engineer
916          student
917        scientist
918            other
919           artist
920          student
921    administrator
922          student
923            other
924         salesman
925    entertainment
926       programmer
927          student
928        scientist
929        scientist
930         educator
931         educator
932          student
933         engineer
934           doctor
935            other
936         educator
937       technician
938          student
939    administrator
940          student
941        librarian
942          student
Name: occupation, Length: 943, dtype: object

## Step 13) How many different occupations there are inthis dataset?

In [21]:
len(user_id.occupation.unique())

21

## Step 14) What is the most frequent occupation?

In [22]:
user_id.occupation.head()

0    technician
1         other
2        writer
3    technician
4         other
Name: occupation, dtype: object

user_id

In [23]:
df.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [24]:
user_id = df

In [25]:
user_id.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [28]:
user_id.occupation.count()

943

In [29]:
user_id.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [31]:
user_id.groupby('occupation').sum()

               user_id   age
occupation
administrator    34045  3061
artist           12653   879
doctor            3736   305
educator         44356  3991
engineer         30574  2438
entertainment     7164   526
executive        13514  1239
healthcare        8023   665
homemaker         3101   228
lawyer            4309   441
librarian        24816  2040
marketing        11383   978
none              3318   239
other            56987  3625
programmer       28745  2186
retired           7220   883
salesman          5939   428
scientist        14419  1102
student          95051  4328
technician       13436   895
writer           22307  1634

## Step 14) Summarize the DataFrame

In [33]:
user_id.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

## Step 15) Summarize all the columns

## Step 16) Summarize the occupation column

In [34]:
user_id.occupation.describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

## Step 17) What is the mean age of users

In [35]:
## 34.051962

## Step 18) What is the age with least occurrence

In [36]:
## 7